<details>
<summary><a href="https://linear.app/sleuth/issue/TIE-268/tf-provider-issue-with-constantly-updating-environments-for-build">TIE-268 TF Provider issue with constantly updating environments for build mappings</a></summary>
<p>

Customer **JR Simplot** has been reporting issues when generating environment mappings using our TF provider. 

For troubleshooting purposes, they've provided us with their `main.tf` and `variables.tf` files:

```
# https://registry.terraform.io/providers/sleuth-io/sleuth/latest/docs
terraform {
  required_providers {
    sleuth = {
      source = "sleuth-io/sleuth"
      # 0.4.4 contains a fix that allows to delete the projects in Sleuth
      version = ">= 0.4.4"
    }
  }
}

# https://registry.terraform.io/providers/sleuth-io/sleuth/latest/docs/resources/project
resource "sleuth_project" "app_project" {
  name           = var.repo_name
  build_provider = "AZURE"
}

resource "sleuth_environment" "environments" {
  project_slug = sleuth_project.app_project.slug

  count = length(var.mappings)

  #because sleuth have a default Production environment that is titled
  name  = title(lower(var.mappings[count.index].env))
  color = var.mappings[count.index].color
}

# https://registry.terraform.io/providers/sleuth-io/sleuth/0.4.1/docs/resources/code_change_source
resource "sleuth_code_change_source" "code_change_source" {
  project_slug = sleuth_project.app_project.slug
  name         = var.repo_name

  repository {
    repo_uid         = var.repo_uid
    project_uid      = var.project_uid
    name             = var.repo_name
    owner            = var.repo_owner
    provider         = "AZURE"
    url              = var.repo_url
    integration_slug = "azure-devops-appd"
  }

  #added this as dynamic here to be able to configure multiple environment mappings using the var.mappings var
  dynamic "environment_mappings" {
    for_each = var.mappings

    content {
      environment_slug = sleuth_environment.environments[environment_mappings.key].slug #lower(environment_mappings.value.env)
      branch           = environment_mappings.value.branch
    }
  }

  dynamic "build_mappings" {
    for_each = var.mappings

    content {
      build_name       = sleuth_project.app_project.name
      job_name         = build_mappings.value.build_name
      environment_slug = sleuth_environment.environments[build_mappings.key].slug
      provider         = "AZURE"
      project_key      = "AppD"
      match_branch_to_environment = false
    }
  }

  deploy_tracking_type = "build"
  collect_impact       = false
  notify_in_slack      = false
}
```

---

```
variable "repo_name" {
  description = "name of the repo associated to the project"
  type        = string
}

variable "repo_url" {
  description = "URL of the repo associated to the project"
  type        = string
}

#this can be obtained listing the repositories using the AZDO API https://learn.microsoft.com/en-us/rest/api/azure/devops/git/repositories/list?view=azure-devops-rest-6.0&tabs=HTTP
#GET https://dev.azure.com/{organization}/{project}/_apis/git/repositories?api-version=6.0
variable "repo_uid" {
  description = "uid of the repo"
  type        = string
}

#added as default AppD
variable "repo_owner" {
  description = "owner of the repo associated to the project"
  type        = string
  default     = "AppD"
}

#this can be obtained listing the repositories using the AZDO API https://learn.microsoft.com/en-us/rest/api/azure/devops/git/repositories/list?view=azure-devops-rest-6.0&tabs=HTTP
#GET https://dev.azure.com/{organization}/{project}/_apis/git/repositories?api-version=6.0
variable "project_uid" {
  description = "uid of the project"
  type        = string
}

#added as default the most common mapping
variable "mappings" {
  description = "mappings used for environment and build mappings creation"

  type = list(object({
    env        = string
    branch     = string
    build_name = string #pipeline name
    color      = string
  }))

  default = [
    {
      env        = "production"
      branch     = "master"
      build_name = "deploy_prod"
      color      = "#EBB700"
    },
    {
      env        = "test"
      branch     = "master"
      build_name = "deploy_test"
      color      = "#69BE28"
    }
  ]
}
```

I have used the exact **same file structure**, substituting the **Azure repository and integration values** for my own so I could test this.

As can be seen from the files, the environment default values in `variables.tf` are sorted alphabetically. When the plan is applied, the environments are generated in the correct order, judging by the numbering of instances:

* `sleuth_environment.environments[0]` corresponds to `production`
* `sleuth_environment.environments[1]` corresponds to `test`

```
❯ terraform apply
provider.sleuth.api_key
  The Sleuth organization's Api key

  Enter a value: <API_KEY>


Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # sleuth_code_change_source.code_change_source will be created
  + resource "sleuth_code_change_source" "code_change_source" {
      + auto_tracking_delay  = 0
      + collect_impact       = false
      + deploy_tracking_type = "build"
      + id                   = (known after apply)
      + include_in_dashboard = true
      + name                 = "Support"
      + notify_in_slack      = false
      + project_slug         = (known after apply)

      + build_mappings {
          + build_name                  = "support-pipeline"
          + environment_slug            = (known after apply)
          + match_branch_to_environment = false
          + project_key                 = "Support"
          + provider                    = "AZURE"
        }
      + build_mappings {
          + build_name                  = "support-pipeline"
          + environment_slug            = (known after apply)
          + match_branch_to_environment = false
          + project_key                 = "Support"
          + provider                    = "AZURE"
        }

      + environment_mappings {
          + branch           = "main"
          + environment_slug = (known after apply)
          + id               = (known after apply)
        }
      + environment_mappings {
          + branch           = "main"
          + environment_slug = (known after apply)
          + id               = (known after apply)
        }

      + repository {
          + integration_slug = "azure-devops-with-description"
          + name             = "Support"
          + owner            = "ajulian"
          + project_uid      = "98bacca0-259d-4446-8813-3873d0783f84"
          + provider         = "AZURE"
          + repo_uid         = "af11ddfc-290f-444f-98d4-0bfb5439faee"
          + url              = "https://dev.azure.com/lem00r/Support/_git/Support"
        }
    }

  # sleuth_environment.environments[0] will be created
  + resource "sleuth_environment" "environments" {
      + color        = "#EBB700"
      + id           = (known after apply)
      + name         = "Production"
      + project_slug = (known after apply)
      + slug         = (known after apply)
    }

  # sleuth_environment.environments[1] will be created
  + resource "sleuth_environment" "environments" {
      + color        = "#69BE28"
      + id           = (known after apply)
      + name         = "Test"
      + project_slug = (known after apply)
      + slug         = (known after apply)
    }

  # sleuth_project.app_project will be created
  + resource "sleuth_project" "app_project" {
      + build_provider               = "AZURE"
      + change_failure_rate_boundary = "UNHEALTHY"
      + failure_sensitivity          = 420
      + id                           = (known after apply)
      + impact_sensitivity           = "NORMAL"
      + issue_tracker_provider_type  = "SOURCE_PROVIDER"
      + name                         = "Support"
      + slug                         = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

7sleuth_project.app_project: Creating...
sleuth_project.app_project: Creation complete after 1s [id=support-3]
sleuth_environment.environments[1]: Creating...
sleuth_environment.environments[0]: Creating...
sleuth_environment.environments[1]: Creation complete after 1s [id=support-3/test]
sleuth_environment.environments[0]: Creation complete after 1s [id=support-3/production]
sleuth_code_change_source.code_change_source: Creating...
sleuth_code_change_source.code_change_source: Creation complete after 1s [id=support-3/support-3]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
```

After creating the resources in my Sleuth org, I then ran the `terraform plan` command again, the output:

```
❯ terraform plan
provider.sleuth.api_key
  The Sleuth organization's Api key

  Enter a value: <API_KEY>

sleuth_project.app_project: Refreshing state... [id=support-3]
sleuth_environment.environments[1]: Refreshing state... [id=support-3/test]
sleuth_environment.environments[0]: Refreshing state... [id=support-3/production]
sleuth_code_change_source.code_change_source: Refreshing state... [id=support-3/support-3]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # sleuth_code_change_source.code_change_source will be updated in-place
  ~ resource "sleuth_code_change_source" "code_change_source" {
        id                   = "support-3/support-3"
        name                 = "Support"
        # (6 unchanged attributes hidden)

      ~ build_mappings {
          ~ environment_slug            = "test" -> "production"
          ~ provider                    = "azure" -> "AZURE"
            # (3 unchanged attributes hidden)
        }
      ~ build_mappings {
          ~ environment_slug            = "production" -> "test"
          ~ provider                    = "azure" -> "AZURE"
            # (3 unchanged attributes hidden)
        }

      ~ repository {
          + integration_slug = "azure-devops-with-description"
            name             = "Support"
            # (5 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

It seems the resource that is problematic are the **build mappings** on the **code change source** resource, not the environment ones? 🤔 

---

The customer came back today with a pretty technical answer and a bunch of examples I am not sure I am qualified to interpret, so attaching below in full for your consideration.

---

*I spent some time getting frustrated with this provider this morning.  No amount of sorting our hcl tf files can solve the underlying issues with build mappings and environment mappings. As implemented, this blocks our adoption of sleuth.io.*

*It’s probably exasperated by the fact that we are defining these with dynamic blocks:*

```
  #added this as dynamic here to be able to configure multiple environment mappings using the var.mappings var

  dynamic "environment_mappings" {
    for_each = sort(keys(var.deployable_environments))

    content {
      environment_slug = sleuth_environment.environments[environment_mappings.value].slug
      branch           = var.deployable_environments[environment_mappings.value].branch
    }
  }

 

  dynamic "build_mappings" {
  # sleuth seems to return these in reverse alphabetical order??
    for_each = sort(keys(var.deployable_environments))

    content {
      build_name       = sleuth_project.app_project.name
      job_name         = var.deployable_environments[build_mappings.value].deploy_job_name
      environment_slug = sleuth_environment.environments[build_mappings.value].slug
      provider         = sleuth_project.app_project.build_provider
      project_key      = var.repo_owner
      match_branch_to_environment = false
    }
  }
```

 

*Where* `var.deployable_environments` *is defined as*

```
  deployable_environments =     {
    Production = {
      branch     = "master"
      deploy_job_name = "deploy_prod"
      color      = "#EBB700"
    }

    zzz = {
      branch     = "master"
      deploy_job_name = "deploy_zz"
      color      = "#FFF000"
    }

    aaa = {
      branch     = "master"
      deploy_job_name = "deploy_test"
      color      = "#69BE28"
   }

    test = {
      branch     = "master"
      deploy_job_name = "deploy_test"
      color      = "#69BE28"
    }
  }
```


*Subsequent plans show all manner of weird position changes because the order in dynamic blocks is…somewhat dubious.  EG:*

```
# module.project_getpaid.sleuth_code_change_source.code_change_source will be updated in-place

  ~ resource "sleuth_code_change_source" "code_change_source" {
        id                   = "getpaid/getpaid-2"
        name                 = "GetPaid"
        # (6 unchanged attributes hidden)

      ~ build_mappings {
          ~ environment_slug            = "zzz" -> "production"
          ~ job_name                    = "deploy_zz" -> "deploy_prod"
            # (4 unchanged attributes hidden)
        }

      ~ build_mappings {
          ~ environment_slug            = "test" -> "aaa"
            # (5 unchanged attributes hidden)
        }

      ~ build_mappings {
          ~ environment_slug            = "aaa" -> "test"
            # (5 unchanged attributes hidden)
        }

      ~ build_mappings {
          ~ environment_slug            = "production" -> "zzz"
          ~ job_name                    = "deploy_prod" -> "deploy_zz"
            # (4 unchanged attributes hidden)

        }

      ~ environment_mappings {
          ~ environment_slug = "aaa" -> "production"
            id               = "getpaid/aaa"
            # (1 unchanged attribute hidden)
        }

      ~ environment_mappings {
          ~ environment_slug = "production" -> "aaa"
            id               = "getpaid/production"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }
```

 

*Traditional providers would match the block instances up by a key parameter of some sort to avoid this issue.  Tried multiple different ways to sort these dynamic blocks but they all show different issues.*

*There are some other smaller issues that are plaguing this provider too that we can get past with short-term workarounds.*

*(Issue 3) The build_mappings provider attribute must be specified as “AZURE” to be successfully created, but it is read out as “azure” so every subsequent plan shows a change.  We can work around this by ignoring this change, but it’s not proper to do this long-term.*

*(Issue 4) The repository integration_slug is required to be set for creation, but it is never read correctly, and thus plans always show it needing to be set.  Again we can ignore this change, but it’s not proper to do this long term.* 

*Could be we’re using this provider wrong, and if so please advise, but fairly confident the issue resides in the provider itself*
</p>
</details>